In [9]:
## How to assign a new column in a Pandas DataFrame
# load libraries
import pandas as pd

# Create empty dataframe
df = pd.DataFrame()
 # Create a column
df['StudentName'] = ['John', 'Steve', 'Sarah']
# View dataframe
print(df)
 # Assign a new column to df
df = df.assign(marks =[78,89,99])
print(df)

  StudentName
0        John
1       Steve
2       Sarah
  StudentName  marks
0        John     78
1       Steve     89
2       Sarah     99

In [21]:
# How to Normalise a Pandas DataFrame Column
# load libraries
import pandas as pd

# Create an example dataframe with a column of unnormalized data
data = {'score':[234,345,456,567,678,789]}

df = pd.DataFrame(data)
print(df)
# Normalize The Column
df1= pd.DataFrame(data, dtype = float)
print(df1)
x = df[['score']].values.astype(float)
print(x)

   score
0    234
1    345
2    456
3    567
4    678
5    789
   score
0  234.0
1  345.0
2  456.0
3  567.0
4  678.0
5  789.0
[[234.]
 [345.]
 [456.]
 [567.]
 [678.]
 [789.]]

In [35]:
# How to convert string categorical variables into numerical variables using Label Encoder
from sklearn.preprocessing import LabelEncoder

# Create dataframe
raw_data = {'patient': [1, 1, 1, 2, 2],
                'obs': [1, 2, 3, 1, 2],
                'treatment': [0, 1, 0, 1, 0],
                'score': ['strong', 'weak', 'normal', 'weak', 'strong']}
#df = pd.DataFrame(raw_data)
df = pd.DataFrame(raw_data,columns=['patient', 'obs', 'treatment', 'score'])
print(df)
columnsToEncode = list(df.select_dtypes(include=['category','object']))
print(df[columnsToEncode])
le = LabelEncoder()
for feature in columnsToEncode:
  try:
      df[feature] = le.fit_transform(df[feature])
  except:
      print('Error encoding '+feature)
print(df)

   patient  obs  treatment   score
0        1    1          0  strong
1        1    2          1    weak
2        1    3          0  normal
3        2    1          1    weak
4        2    2          0  strong
    score
0  strong
1    weak
2  normal
3    weak
4  strong
   patient  obs  treatment  score
0        1    1          0      1
1        1    2          1      2
2        1    3          0      0
3        2    1          1      2
4        2    2          0      1

In [36]:
# How to delete duplicates from a Pandas DataFrame
# load libraries
import pandas as pd

# Create dataframe with duplicates
raw_data = {'first_name': 
['Jason', 'Jason', 'Jason','Tina', 'Jake', 'Amy'],
'last_name': ['Miller', 'Miller', 'Miller','Ali', 'Milner', 'Cooze'],
'age': [42, 42, 1111111, 36, 24, 73],
'preTestScore': [4, 4, 4, 31, 2, 3],
'postTestScore': [25, 25, 25, 57, 62, 70]}
df = pd.DataFrame(raw_data)
df

  first_name last_name      age  preTestScore  postTestScore
0      Jason    Miller       42             4             25
1      Jason    Miller       42             4             25
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

In [39]:
# Identify which observations are duplicates
print(); print(df.duplicated())
print(); 
df

0    False
1     True
2    False
3    False
4    False
5    False
dtype: bool

  first_name last_name      age  preTestScore  postTestScore
0      Jason    Miller       42             4             25
1      Jason    Miller       42             4             25
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

In [45]:
df

  first_name last_name      age  preTestScore  postTestScore
0      Jason    Miller       42             4             25
1      Jason    Miller       42             4             25
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

In [47]:
print(df.drop_duplicates(keep='first'))

  first_name last_name      age  preTestScore  postTestScore
0      Jason    Miller       42             4             25
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

In [40]:
print(df.drop_duplicates(keep='first'))

  first_name last_name      age  preTestScore  postTestScore
0      Jason    Miller       42             4             25
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

In [41]:
df

  first_name last_name      age  preTestScore  postTestScore
0      Jason    Miller       42             4             25
1      Jason    Miller       42             4             25
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

In [42]:
# Drop duplicates in the first name column, but take the last obs in the duplicated set
print(); print(df.drop_duplicates(['first_name'], keep='last'))

  first_name last_name      age  preTestScore  postTestScore
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

In [43]:
df

  first_name last_name      age  preTestScore  postTestScore
0      Jason    Miller       42             4             25
1      Jason    Miller       42             4             25
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

In [44]:
print(); print(df.drop_duplicates(['first_name']))

  first_name last_name  age  preTestScore  postTestScore
0      Jason    Miller   42             4             25
3       Tina       Ali   36            31             57
4       Jake    Milner   24             2             62
5        Amy     Cooze   73             3             70

In [49]:
# Create dataframe
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'year': [2012, 2012, 2013, 2014, 2014],
        'reports': [4, 24, 31, 2, 3],
        'coverage': [25, 94, 57, 62, 70]}

df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
print(); print(df)

             name  year  reports  coverage
Cochice     Jason  2012        4        25
Pima        Molly  2012       24        94
Santa Cruz   Tina  2013       31        57
Maricopa     Jake  2014        2        62
Yuma          Amy  2014        3        70

In [50]:
# Create a new column that is the rank of the value of coverage in ascending order
df['coverageRanked'] = df['coverage'].rank(ascending=True)
print(); print(df)

             name  year  reports  coverage  coverageRanked
Cochice     Jason  2012        4        25             1.0
Pima        Molly  2012       24        94             5.0
Santa Cruz   Tina  2013       31        57             2.0
Maricopa     Jake  2014        2        62             3.0
Yuma          Amy  2014        3        70             4.0

In [51]:
# Create a new column that is the rank of the value of coverage in descending order
df['coverageRanked'] = df['coverage'].rank(ascending=False)
print(); print(df)

             name  year  reports  coverage  coverageRanked
Cochice     Jason  2012        4        25             5.0
Pima        Molly  2012       24        94             1.0
Santa Cruz   Tina  2013       31        57             4.0
Maricopa     Jake  2014        2        62             3.0
Yuma          Amy  2014        3        70             2.0

In [56]:
#How to format string in a Pandas DataFrame Column
# load libraries
import pandas as pd

# Create a list of first names
first_names = pd.Series(['steve Murrey', 'Jane Fonda',
                         'Sara McGully', 'Mary Jane'])
# print the column with lower case
#print(); print(first_names.str.lower())

# print the column with upper case
#print(); print(first_names.str.upper())

# print the column with title case
print(); print(first_names.str.title())

# print the column split across spaces
print(); print(first_names.str.split(" "))

# print the column with capitalized case
#print(); print(first_names.str.capitalize())

0    Steve Murrey
1      Jane Fonda
2    Sara Mcgully
3       Mary Jane
dtype: object

0    [steve, Murrey]
1      [Jane, Fonda]
2    [Sara, McGully]
3       [Mary, Jane]
dtype: object

In [60]:
#How to create Pivot table using a Pandas DataFrame
# load libraries
import pandas as pd

# Create dataframe
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks',
                         'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons',
                         'Scouts', 'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd',
                        '2nd','1st', '1st', '2nd', '2nd'],
            'TestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3]}

df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'TestScore'])
print(); print(df)
# Create a pivot table of group means, by company and regiment
df1 = pd.pivot_table(df, index=['regiment','company'], aggfunc='mean')
print(); print(df1)

      regiment company  TestScore
0   Nighthawks     1st          4
1   Nighthawks     1st         24
2   Nighthawks     2nd         31
3   Nighthawks     2nd          2
4     Dragoons     1st          3
5     Dragoons     1st          4
6     Dragoons     2nd         24
7     Dragoons     2nd         31
8       Scouts     1st          2
9       Scouts     1st          3
10      Scouts     2nd          2
11      Scouts     2nd          3

                    TestScore
regiment   company
Dragoons   1st            3.5
           2nd           27.5
Nighthawks 1st           14.0
           2nd           16.5
Scouts     1st            2.5
           2nd            2.5

In [61]:
df1 = pd.pivot_table(df, index=['regiment','company'], aggfunc='sum')
print(); print(df1)

                    TestScore
regiment   company
Dragoons   1st              7
           2nd             55
Nighthawks 1st             28
           2nd             33
Scouts     1st              5
           2nd              5

In [62]:
# Create a pivot table of group score counts, by company and regimensts
df2 = df.pivot_table(index=['regiment','company'], aggfunc='count')
print(); print(df2)

                    TestScore
regiment   company
Dragoons   1st              2
           2nd              2
Nighthawks 1st              2
           2nd              2
Scouts     1st              2
           2nd              2

In [64]:
 # Create a pivot table of group score max, by company and regimensts
df3 = df.pivot_table(index=['regiment','company'], aggfunc='max')
print(df)
print(); print(df3)

      regiment company  TestScore
0   Nighthawks     1st          4
1   Nighthawks     1st         24
2   Nighthawks     2nd         31
3   Nighthawks     2nd          2
4     Dragoons     1st          3
5     Dragoons     1st          4
6     Dragoons     2nd         24
7     Dragoons     2nd         31
8       Scouts     1st          2
9       Scouts     1st          3
10      Scouts     2nd          2
11      Scouts     2nd          3

                    TestScore
regiment   company
Dragoons   1st              4
           2nd             31
Nighthawks 1st             24
           2nd             31
Scouts     1st              3
           2nd              3

      regiment company  TestScore
0   Nighthawks     1st          4
1   Nighthawks     1st         24
2   Nighthawks     2nd         31
3   Nighthawks     2nd          2
4     Dragoons     1st          3
5     Dragoons     1st          4
6     Dragoons     2nd         24
7     Dragoons     2nd         31
8       Scouts     1st          2
9       Scouts     1st          3
10      Scouts     2nd          2
11      Scouts     2nd          3

            TestScore company
regiment
Dragoons           31     2nd
Nighthawks         31     2nd
Scouts              3     2nd

In [76]:
# How to calculate MOVING AVG in a Pandas DataFrame
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks',
                         'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts',
                         'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd',
                        '2nd','1st', '1st', '2nd', '2nd'],
            'name': ['Miller', 'Jacobson', 'Bali', 'Milner', 'Cooze', 'Jacon',
                     'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'],
            'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'name',
                                       'preTestScore', 'postTestScore'])
print(); print(df)

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd      Bali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [77]:
 # Calculate Rolling Moving Average with Window of 2
df1 = df[['preTestScore','postTestScore']].rolling(window=2).mean()
df1

    preTestScore  postTestScore
0            NaN            NaN
1           14.0           59.5
2           27.5           75.5
3           16.5           59.5
4            2.5           66.0
5            3.5           47.5
6           14.0           59.5
7           27.5           75.5
8           16.5           59.5
9            2.5           66.0
10           2.5           66.0
11           2.5           66.0

In [78]:
df2 = df1.fillna(0)
print(); print(df2)

    preTestScore  postTestScore
0            0.0            0.0
1           14.0           59.5
2           27.5           75.5
3           16.5           59.5
4            2.5           66.0
5            3.5           47.5
6           14.0           59.5
7           27.5           75.5
8           16.5           59.5
9            2.5           66.0
10           2.5           66.0
11           2.5           66.0

In [80]:
# How to deal with missing values in a Pandas DataFrame
# load libraries
import pandas as pd
import numpy as np

# Create dataframe with missing values
raw_data = {'first_name': ['Jason', np.nan, 'Tina', 'Jake', 'Amy'],
            'last_name': ['Miller', np.nan, 'Ali', 'Milner', 'Cooze'],
            'age': [42, np.nan, 36, 24, 73],
            'sex': ['m', np.nan, 'f', 'm', 'f'],
            'preTestScore': [4, np.nan, np.nan, 2, 3],
            'postTestScore': [25, np.nan, np.nan, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'sex',
                                       'preTestScore', 'postTestScore'])
print(); print(df)

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Tina       Ali  36.0    f           NaN            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [81]:
# Drop missing observations
df_no_missing = df.dropna()
print(); print(df_no_missing)

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [82]:
df

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Tina       Ali  36.0    f           NaN            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [84]:
# Drop rows where all cells in that row is NA
df_cleaned = df.dropna(how='all')
print(); print(df_cleaned)

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
2       Tina       Ali  36.0   f           NaN            NaN
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [86]:
# Create a new column full of missing values
df['location'] = np.nan
print(); print(df)

  first_name last_name   age  sex  preTestScore  postTestScore  location
0      Jason    Miller  42.0    m           4.0           25.0       NaN
1        NaN       NaN   NaN  NaN           NaN            NaN       NaN
2       Tina       Ali  36.0    f           NaN            NaN       NaN
3       Jake    Milner  24.0    m           2.0           62.0       NaN
4        Amy     Cooze  73.0    f           3.0           70.0       NaN

In [87]:
# Drop column if they only contain missing values
print(); print(df.dropna(axis=1, how='all'))

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Tina       Ali  36.0    f           NaN            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [88]:
print(); print(df.dropna(axis=0, how='all'))

  first_name last_name   age sex  preTestScore  postTestScore  location
0      Jason    Miller  42.0   m           4.0           25.0       NaN
2       Tina       Ali  36.0   f           NaN            NaN       NaN
3       Jake    Milner  24.0   m           2.0           62.0       NaN
4        Amy     Cooze  73.0   f           3.0           70.0       NaN

In [90]:
# Drop rows that contain less than five observations
# This is really mostly useful for time series
print(df)
print(); print(df.dropna(thresh=3))

  first_name last_name   age  sex  preTestScore  postTestScore  location
0      Jason    Miller  42.0    m           4.0           25.0       NaN
1        NaN       NaN   NaN  NaN           NaN            NaN       NaN
2       Tina       Ali  36.0    f           NaN            NaN       NaN
3       Jake    Milner  24.0    m           2.0           62.0       NaN
4        Amy     Cooze  73.0    f           3.0           70.0       NaN

  first_name last_name   age sex  preTestScore  postTestScore  location
0      Jason    Miller  42.0   m           4.0           25.0       NaN
2       Tina       Ali  36.0   f           NaN            NaN       NaN
3       Jake    Milner  24.0   m           2.0           62.0       NaN
4        Amy     Cooze  73.0   f           3.0           70.0       NaN

In [92]:
print(df.dropna(thresh=4))

  first_name last_name   age sex  preTestScore  postTestScore  location
0      Jason    Miller  42.0   m           4.0           25.0       NaN
2       Tina       Ali  36.0   f           NaN            NaN       NaN
3       Jake    Milner  24.0   m           2.0           62.0       NaN
4        Amy     Cooze  73.0   f           3.0           70.0       NaN

In [93]:
df

  first_name last_name   age  sex  preTestScore  postTestScore  location
0      Jason    Miller  42.0    m           4.0           25.0       NaN
1        NaN       NaN   NaN  NaN           NaN            NaN       NaN
2       Tina       Ali  36.0    f           NaN            NaN       NaN
3       Jake    Milner  24.0    m           2.0           62.0       NaN
4        Amy     Cooze  73.0    f           3.0           70.0       NaN

In [94]:
# Fill in missing data with zeros
print(); print(df.fillna(0))

  first_name last_name   age sex  preTestScore  postTestScore  location
0      Jason    Miller  42.0   m           4.0           25.0       0.0
1          0         0   0.0   0           0.0            0.0       0.0
2       Tina       Ali  36.0   f           0.0            0.0       0.0
3       Jake    Milner  24.0   m           2.0           62.0       0.0
4        Amy     Cooze  73.0   f           3.0           70.0       0.0

In [95]:
print(df.dropna(axis=1))

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [96]:
df

  first_name last_name   age  sex  preTestScore  postTestScore  location
0      Jason    Miller  42.0    m           4.0           25.0       NaN
1        NaN       NaN   NaN  NaN           NaN            NaN       NaN
2       Tina       Ali  36.0    f           NaN            NaN       NaN
3       Jake    Milner  24.0    m           2.0           62.0       NaN
4        Amy     Cooze  73.0    f           3.0           70.0       NaN

In [97]:
# Fill in missing in preTestScore with the mean value of preTestScore
# inplace=True means that the changes are saved to the df right away
df["preTestScore"].fillna(df["preTestScore"].mean(), inplace=True)
print(); print(df)

  first_name last_name   age  sex  preTestScore  postTestScore  location
0      Jason    Miller  42.0    m           4.0           25.0       NaN
1        NaN       NaN   NaN  NaN           3.0            NaN       NaN
2       Tina       Ali  36.0    f           3.0            NaN       NaN
3       Jake    Milner  24.0    m           2.0           62.0       NaN
4        Amy     Cooze  73.0    f           3.0           70.0       NaN

In [100]:
# Fill in missing in preTestScore with the mean value of preTestScore
# inplace=True means that the changes are saved to the df right away
df["preTestScore"].fillna(df["preTestScore"].mean(), inplace=True)
df['postTestScore'].fillna(df['postTestScore'].mean(),inplace=True)
print(df)

  first_name last_name   age  sex  preTestScore  postTestScore  location
0      Jason    Miller  42.0    m           4.0      25.000000       NaN
1        NaN       NaN   NaN  NaN           3.0      52.333333       NaN
2       Tina       Ali  36.0    f           3.0      52.333333       NaN
3       Jake    Milner  24.0    m           2.0      62.000000       NaN
4        Amy     Cooze  73.0    f           3.0      70.000000       NaN

In [101]:
df

  first_name last_name   age  sex  preTestScore  postTestScore  location
0      Jason    Miller  42.0    m           4.0      25.000000       NaN
1        NaN       NaN   NaN  NaN           3.0      52.333333       NaN
2       Tina       Ali  36.0    f           3.0      52.333333       NaN
3       Jake    Milner  24.0    m           2.0      62.000000       NaN
4        Amy     Cooze  73.0    f           3.0      70.000000       NaN

In [102]:
# Fill in missing in postTestScore with each sexs mean value of postTestScore
df["postTestScore"].fillna(df.groupby("sex")["postTestScore"].transform("mean"), inplace=True)
print(); print(df)

  first_name last_name   age  sex  preTestScore  postTestScore  location
0      Jason    Miller  42.0    m           4.0      25.000000       NaN
1        NaN       NaN   NaN  NaN           3.0      52.333333       NaN
2       Tina       Ali  36.0    f           3.0      52.333333       NaN
3       Jake    Milner  24.0    m           2.0      62.000000       NaN
4        Amy     Cooze  73.0    f           3.0      70.000000       NaN

In [104]:
# Select the rows of df where age is not NaN and sex is not NaN
print(); print(df[df['age'].notnull() & df['sex'].notnull()])
print(); print(df[df['age'].notnull() & df['sex'].notnull()].fillna(0))

  first_name last_name   age sex  preTestScore  postTestScore  location
0      Jason    Miller  42.0   m           4.0      25.000000       NaN
2       Tina       Ali  36.0   f           3.0      52.333333       NaN
3       Jake    Milner  24.0   m           2.0      62.000000       NaN
4        Amy     Cooze  73.0   f           3.0      70.000000       NaN

  first_name last_name   age sex  preTestScore  postTestScore  location
0      Jason    Miller  42.0   m           4.0      25.000000       0.0
2       Tina       Ali  36.0   f           3.0      52.333333       0.0
3       Jake    Milner  24.0   m           2.0      62.000000       0.0
4        Amy     Cooze  73.0   f           3.0      70.000000       0.0

In [108]:
#How to map values in a Pandas DataFrame
# Create dataframe
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
            'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
            'age': [42, 52, 36, 24, 73],
            'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data)
print(); print(df)

# Create a dictionary of values
city_to_state = {'San Francisco' : 'California',
                 'Baltimore' : 'Maryland',
                 'Miami' : 'Florida',
                 'Douglas' : 'Arizona',
                 'Boston' : 'Massachusetts'}
print(); print(city_to_state)
# Map the values of the city_to_state dictionary to the values in the city variable
df['state'] = df['city'].map(city_to_state)
print(); print(df)

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

{'San Francisco': 'California', 'Baltimore': 'Maryland', 'Miami': 'Florida', 'Douglas': 'Arizona', 'Boston': 'Massachusetts'}

  first_name last_name  age           city          state
0      Jason    Miller   42  San Francisco     California
1      Molly  Jacobson   52      Baltimore       Maryland
2       Tina       Ali   36          Miami        Florida
3       Jake    Milner   24        Douglas        Arizona
4        Amy     Cooze   73         Boston  Massachusetts

In [111]:
# How to list unique values in a Pandas DataFrame
# Create an example dataframe
data = {'name': ['Jason', 'Molly', 'Tina', 'Tina', 'Amy'],
        'year': [2012, 2012, 2013, 2014, 2014],
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz',
                                 'Maricopa', 'Yuma'])
print(); print(df)
# List unique values in the df['name'] column
print(); print(df.name.unique())

             name  year  reports
Cochice     Jason  2012        4
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31
Maricopa     Tina  2014        2
Yuma          Amy  2014        3

['Jason' 'Molly' 'Tina' 'Amy']

In [115]:
# How to JOIN and MERGE Pandas DataFrame
# Create a dataframe
raw_data = {'subject_id': ['1', '2', '3', '4', '5'],
            'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
            'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}
df_a = pd.DataFrame(raw_data)
print(); print(df_a)

# Create a second dataframe
raw_data = {'subject_id': ['4', '5', '6', '7', '8'],
            'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
            'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}
df_b = pd.DataFrame(raw_data)
print(); print(df_b)

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [116]:
#Create a third dataframe
raw_data = {'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
            'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}
df_n = pd.DataFrame(raw_data)
print(); print(df_n)

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

In [119]:
# Join the two dataframes along rows
df_new = pd.concat([df_a, df_b])
print(); print(df_new)

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [123]:
# Join the two dataframes along columns
df = pd.concat([df_a, df_b], axis=0)
print(); print(df)

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [124]:
df

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [127]:
 # Merge with outer join
df = pd.merge(df_a, df_b, on='subject_id', how='outer')
print(df_a)
print(df_b)
print(); print(df)

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black
5          6          NaN         NaN         Bran     Balwner
6          7          NaN         NaN        Bryce       Brice
7          8          NaN         NaN        Betty      Btisan

In [126]:
# Merge with inner join
df = pd.merge(df_a, df_b, on='subject_id', how='inner')
print(); print(df)

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black

In [129]:
# Merge with right join
df = pd.merge(df_a, df_b, on='subject_id', how='right')
print(); print(df)

# Merge with left join
df = pd.merge(df_a, df_b, on='subject_id', how='left')
print(); print(df)

# Merge while adding a suffix to duplicate column names
df = pd.merge(df_a, df_b, on='subject_id', how='left', suffixes=('_left', '_right'))
print(); print(df)

# Merge based on indexes
df = pd.merge(df_a, df_b, right_index=True, left_index=True)
print(); print(df)

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black
2          6          NaN         NaN         Bran     Balwner
3          7          NaN         NaN        Bryce       Brice
4          8          NaN         NaN        Betty      Btisan

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black

  subject_id first_name_left last_name_left first_name_right last_name_right
0          1            Alex       Anderson              NaN             NaN
1          2             Amy       Ackerman              NaN             NaN
2          3           Allen            Ali              NaN             NaN
3          4           Alice           Aoni            Billy          Bonder
4          5          Ayoung        Atiches            Brian           Black

  subject_id_x first_name_x last_name_x subject_id_y first_name_y last_name_y
0            1         Alex    Anderson            4        Billy      Bonder
1            2          Amy    Ackerman            5        Brian       Black
2            3        Allen         Ali            6         Bran     Balwner
3            4        Alice        Aoni            7        Bryce       Brice
4            5       Ayoung     Atiches            8        Betty      Btisan

In [131]:
#How to present Hierarchical Data in Pandas
# Create dataframe
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks',
                         'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts',
                         'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd',
                        '2nd','1st', '1st', '2nd', '2nd'],
            'name': ['Miller', 'Jacobson', 'Bali', 'Milner', 'Cooze', 'Jacon',
                     'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'],
            'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'name',
                                       'preTestScore', 'postTestScore'])
print(); print(df)

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd      Bali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [132]:
# Set the hierarchical index but leave the columns inplace
df.set_index(['regiment', 'company'], drop=False)
print(); print(df)

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd      Bali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [133]:
# Set the hierarchical index to be by regiment, and then by company
df = df.set_index(['regiment', 'company'])
print(); print(df)

                        name  preTestScore  postTestScore
regiment   company
Nighthawks 1st        Miller             4             25
           1st      Jacobson            24             94
           2nd          Bali            31             57
           2nd        Milner             2             62
Dragoons   1st         Cooze             3             70
           1st         Jacon             4             25
           2nd        Ryaner            24             94
           2nd          Sone            31             57
Scouts     1st         Sloan             2             62
           1st         Piger             3             70
           2nd         Riani             2             62
           2nd           Ali             3             70